In [149]:
#$conda activate py37
#(py37)$ jupyter notebook

In [150]:
# %config IPCompleter.greedy=True

In [151]:
#press [SHIFT] and [TAB] from within the method parentheses

### intellisense - works perfect!! -> excute in command line windows. : (py37) $ -> works perfect !!
# (py37) $pip3 install jupyter-tabnine
# (py37) $sudo jupyter nbextension install --py jupyter_tabnine

# (py37) $jupyter nbextension enable jupyter_tabnine --py
##### jupyter nbextension enable --py jupyter_tabnine ##instead above line excuted. 

# (py37) $jupyter serverextension enable --py jupyter_tabnine

#--> I installed in (py37) conda env.

# Data Cleaning and Preparation

In [152]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data
* pandas objects exclude missing data by default
* For numeric data, pandas uses the floating-point value **NaN (Not a Number)** to represent missing data.
* pandas missing data as **NA**(not available) data
* built-in Python **None** value is also treated as NA in object arrays:

In [153]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [154]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [155]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### NA handling methods
|Argument|Description|
|:-------|:----------|
|dropna|Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate|
|fillna|Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'|
|isnull||
|fillna||

### Filtering Out Missing Data

In [156]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [157]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [158]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [159]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [160]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [161]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [162]:
data[4] = NA # 4 is column -
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [163]:
#test : label location -> number is label
print(data.loc[0:2,1:4])
print("----------------")
print(data.loc[0:2,[1,4]])
print("----------======")
print(data.loc[0,2])
data.loc[0,[2]]

     1    2   4
0  6.5  3.0 NaN
1  NaN  NaN NaN
2  NaN  NaN NaN
----------------
     1   4
0  6.5 NaN
1  NaN NaN
2  NaN NaN
----------======
3.0

2    3.0
Name: 0, dtype: float64

In [164]:
#test : index location -> number is index
print(data.iloc[0:2,1:4])
print("------------------")
print(data.iloc[0,2])
print("----------------")
print(data.iloc[0:2][[1,4]])
print("=========")
data.iloc[0,[2]]

     1    2   4
0  6.5  3.0 NaN
1  NaN  NaN NaN
------------------
3.0
----------------
     1   4
0  6.5 NaN
1  NaN NaN
=========

2    3.0
Name: 0, dtype: float64

In [165]:
data.loc[3]

0    NaN
1    6.5
2    3.0
4    NaN
Name: 3, dtype: float64

In [166]:
data.loc[:,2]

0    3.0
1    NaN
2    NaN
3    3.0
Name: 2, dtype: float64

In [167]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [168]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [169]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.204708       NaN -0.519439
1 -0.555730       NaN  1.393406
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [170]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [171]:
df.dropna()

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [172]:
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [173]:
df.dropna(thresh=2) #default row-wise

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling In Missing Data
* df.fillna(method='ffill')
* series_data.fillna(series_data.mean())

In [174]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [175]:
df.fillna({1: 0.5, 2: 0}) #without inplace=True -> no change to df

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [176]:
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [177]:
_ = df.fillna(0, inplace=True) #df changed!
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [178]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810
3 -0.713544 -0.831154 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512

In [179]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [180]:
#option 1 - replace columns name
df.rename(columns={0:'a', 1:'b', 2:'c'}, inplace=True)
df

          a         b         c
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [181]:
#test
exist_columns = [0,1,2]
new_columns = list('abc')
{x:y for x, y in zip(exist_columns, new_columns) }

{0: 'a', 1: 'b', 2: 'c'}

In [182]:
#option 2
exist_columns = [0,1,2]
new_columns = list('abc')
{x:y for x, y in zip(exist_columns, new_columns) }
df.rename(columns={x:y for x, y in zip(exist_columns, new_columns)}, inplace=True)
#df

In [183]:
#test
df.iloc[3:, 2]

3   -2.370232
4         NaN
5         NaN
Name: c, dtype: float64

In [184]:
#test
df.iloc[3:, 1:3]

    b         c
3 NaN -2.370232
4 NaN       NaN
5 NaN       NaN

In [185]:
df.columns = exist_columns #change columns name
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [186]:
df.fillna(method='ffill')

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

In [187]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [188]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [189]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates : data.drop_duplicates()

In [190]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [191]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [192]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [193]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [194]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [195]:
data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [196]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [197]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [198]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [199]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [200]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [201]:
data['animal'] = lowercased.map(meat_to_animal) #key, lowercased -> map dict{key: value} -> value 
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [202]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values: data.replace(-999, np.nan), data.replace([-999, -1000], [np.nan, 0])

In [203]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [204]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [205]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [206]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [207]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes
* data.index = data.index.map(transform)
 * transform = lambda x: x[:4].upper()
* data.rename(index=str.title, columns=str.upper)

In [208]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [209]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [210]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [211]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [212]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [213]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [214]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning: pd.cut(x=df_ages['age'], bins=[20, 29, 39, 49])

* sets the bins argument to a list of bin edge values. The left bin edge will be exclusive and the right bin edge will be inclusive.

* The bins will be for ages: (20, 29] (someone in their 20s), (30, 39], and (40, 49].
* pd.cut(x=df_ages['age'], bins=[20, 29, 39, 49], right=False)  #[20,29) [30, 39) [40, 49)
* pd.cut(ages, bins3, labels=group_names) 
    * group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
* pd.qcut(data, 4) #1/4

In [215]:
########## test start here !!###########
#randint(start, end, size) , size=(2,4) or just number(1-d)
df_ages = pd.DataFrame({'age': np.random.randint(21, 51, 8)}) #(start, stop, size)-51 not including

In [216]:
df_ages

   age
0   33
1   26
2   29
3   32
4   43
5   42
6   22
7   21

In [217]:
#test a_list frequncy count:collectionsCounter(a_list) 
import collections
a = [1,1,1,1,2,2,2,2,3,3,4,5,5]
counter=collections.Counter(a)
print(counter)

Counter({1: 4, 2: 4, 3: 2, 5: 2, 4: 1})

In [218]:
import collections
counter = collections.Counter(df_ages['age'])
counter.items()

dict_items([(33, 1), (26, 1), (29, 1), (32, 1), (43, 1), (42, 1), (22, 1), (21, 1)])

In [219]:
#test Series_element.value_counts()
df_ages['age'].value_counts()

42    1
29    1
43    1
26    1
22    1
21    1
33    1
32    1
Name: age, dtype: int64

In [220]:
pd.value_counts(df_ages['age'])

42    1
29    1
43    1
26    1
22    1
21    1
33    1
32    1
Name: age, dtype: int64

In [221]:
############ end of test_frequecy_count ########

In [222]:
df_ages['age_bins'] = pd.cut(x=df_ages['age'], bins=[20, 29, 39, 49])

In [223]:
df_ages

   age  age_bins
0   33  (29, 39]
1   26  (20, 29]
2   29  (20, 29]
3   32  (29, 39]
4   43  (39, 49]
5   42  (39, 49]
6   22  (20, 29]
7   21  (20, 29]

In [224]:
########### end of test #########

In [225]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins2 =[20, 29, 39, 49]
bin_group = pd.cut(ages, bins2) #20, 61 -> NaN
bin_group

[NaN, (20.0, 29.0], (20.0, 29.0], (20.0, 29.0], (20.0, 29.0], ..., (29.0, 39.0], NaN, (39.0, 49.0], (39.0, 49.0], (29.0, 39.0]]
Length: 12
Categories (3, interval[int64]): [(20, 29] < (29, 39] < (39, 49]]

#### Return  one of follwing bins - (18,25], (25,35], (35, 60], (60, 100] - which each element in ages list belongs

In [226]:
bins3 = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins3)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [227]:
cats.codes #20->bins index 0, 22 -> bins 0, 25 -> bins 0, 27 -> bins 1 ...

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [228]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [229]:
pd.value_counts(cats)
# cats.value_counts()

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [230]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [231]:
bins3 # 5 element -> 4 bins -> labels = group_names:['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

[18, 25, 35, 60, 100]

In [232]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins3, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [233]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.082, 0.31], (0.31, 0.53], (0.75, 0.98], (0.75, 0.98], (0.082, 0.31], ..., (0.75, 0.98], (0.75, 0.98], (0.53, 0.75], (0.31, 0.53], (0.53, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.082, 0.31] < (0.31, 0.53] < (0.53, 0.75] < (0.75, 0.98]]

In [234]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-0.0512, 0.707], (-3.093, -0.754], (0.707, 3.518], (0.707, 3.518], (-3.093, -0.754], ..., (-0.754, -0.0512], (-0.754, -0.0512], (-0.754, -0.0512], (0.707, 3.518], (-3.093, -0.754]]
Length: 1000
Categories (4, interval[float64]): [(-3.093, -0.754] < (-0.754, -0.0512] < (-0.0512, 0.707] < (0.707, 3.518]]

In [235]:
pd.value_counts(cats)

(0.707, 3.518]       250
(-0.0512, 0.707]     250
(-0.754, -0.0512]    250
(-3.093, -0.754]     250
dtype: int64

In [236]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0512, 1.333], (-1.324, -0.0512], (1.333, 3.518], (1.333, 3.518], (-1.324, -0.0512], ..., (-1.324, -0.0512], (-1.324, -0.0512], (-1.324, -0.0512], (1.333, 3.518], (-1.324, -0.0512]]
Length: 1000
Categories (4, interval[float64]): [(-3.093, -1.324] < (-1.324, -0.0512] < (-0.0512, 1.333] < (1.333, 3.518]]

### Detecting and Filtering Outliers
* data[(np.abs(data) > 3).any(1)] #column-wise -> each row(show total rows)
* data[np.abs(data) > 3] = np.sign(data) * 3  #cap values outside the interval –3 to 3

In [237]:
data = pd.DataFrame(np.random.randn(1000, 4))
print(data.shape)
data.describe()

(1000, 4)

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014506    -0.014620     0.009250    -0.024730
std       1.019796     1.020937     0.981205     1.017302
min      -3.469750    -3.159794    -3.737550    -3.440306
25%      -0.658601    -0.702403    -0.662707    -0.708711
50%       0.002804    -0.007532     0.007000    -0.035584
75%       0.646669     0.691364     0.680052     0.638422
max       3.423630     2.991888     2.877019     3.458390

In [238]:
data.head() #(1000, 4)

          0         1         2         3
0  0.627322 -0.360740  0.867818  0.666125
1  0.325341 -0.073107 -0.725240 -2.529919
2  0.094908  0.553004  1.092401 -1.884728
3 -0.866206 -0.340591  0.795713 -0.577072
4  0.539015 -0.882567  0.272218  0.993740

In [239]:
data[0] # 0 is column name <- DataFrame[label]

0      0.627322
1      0.325341
2      0.094908
3     -0.866206
4      0.539015
         ...
995   -0.322308
996   -0.657510
997   -0.651059
998    0.008570
999    0.039018
Name: 0, Length: 1000, dtype: float64

In [240]:
data.iloc[0,:] #row label 0, all colums

0    0.627322
1   -0.360740
2    0.867818
3    0.666125
Name: 0, dtype: float64

find values in column label 2, exceeding 3 in absolute
value:

In [241]:
col = data[2] #column label 2
print(col.shape)
col

(1000,)

0      0.867818
1     -0.725240
2      1.092401
3      0.795713
4      0.272218
         ...
995   -1.985934
996   -0.290328
997   -1.123242
998    0.281352
999   -0.550964
Name: 2, Length: 1000, dtype: float64

In [242]:
col[np.abs(col) > 3] #absolute value of label 2 colum > 3 -> label 2 column

696   -3.73755
Name: 2, dtype: float64

In [243]:
################## test ################
# creating dictionary 
dic_any = {'A': [1, 2, 3, 4, 0, np.nan, 3], 
       'B': [3, 1, 4, 5, 0, np.nan, 5], 
       'C': [0, 0, 0, 0, 0, 0, 0]} 
  
# making dataframe using dictionary 
data_any = pd.DataFrame(dic_any) 
print(data_any)
# calling data_any.any index wise 
result1 = data_any.any(axis = 0)
print("-----------data_any.any(axis = 0)-------------------")
print(result1)
print("---------- data_any.any(axis = 1)-------------------")
# calling data_any.any column wise 
result2 = data_any.any(axis = 1) 
print(result2)

     A    B  C
0  1.0  3.0  0
1  2.0  1.0  0
2  3.0  4.0  0
3  4.0  5.0  0
4  0.0  0.0  0
5  NaN  NaN  0
6  3.0  5.0  0
-----------data_any.any(axis = 0)-------------------
A     True
B     True
C    False
dtype: bool
---------- data_any.any(axis = 1)-------------------
0     True
1     True
2     True
3     True
4    False
5    False
6     True
dtype: bool

In [244]:
(np.abs(data) > 3)

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [245]:
(np.abs(data) > 3).any(1) #1 -> column-wise -> each row

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [246]:
(data[(np.abs(data) > 3).any(1)]).index

Int64Index([ 64, 114, 339, 348, 364, 389, 465, 478, 529, 571, 696, 720, 742,
            751, 752, 786, 955, 977],
           dtype='int64')

In [247]:
(np.abs(data) > 3).any(0) #0 -> row-wise -> each column(total 4 columns)

0    True
1    True
2    True
3    True
dtype: bool

* To select all rows having a value exceeding 3 or –3, you can use the any method on a boolean DataFrame

In [249]:
data[(np.abs(data) > 3).any(1)] # column-wise -> each row(total 1000 rows)

            0         1         2         3
64  -0.333478  0.133808 -0.019238  3.266327
114  3.195526 -1.696884 -0.041715  0.018676
339 -1.579132 -1.479182  0.033978  3.328159
348  3.075869 -0.677797  1.266258  0.113867
364 -3.469750  0.771808  0.200451 -0.022348
389 -0.123562 -3.069748 -0.776968  0.910161
465  0.650290  0.468384  0.560400  3.458390
478  0.027374 -3.159794  1.531614  0.555094
529 -2.017702 -0.601417 -2.138661 -3.052244
571  0.582463 -2.546004  2.563969  3.064597
696  0.628721  0.245917 -3.737550  0.063304
720 -0.005351 -0.865512  0.585719 -3.009386
742  0.091499 -0.843675 -0.657652  3.107432
751 -0.024451 -1.613277 -1.011946 -3.184964
752  3.262894  1.500865 -1.143519  0.263594
786 -3.206012 -0.225109 -0.395246 -1.199893
955  0.534290  0.650475  0.460878 -3.440306
977  3.423630 -0.881804  0.631546  1.882044

In [293]:
#cap values outside the interval –3 to 3
data[np.abs(data) > 3] = np.sign(data) * 3

In [291]:
#test
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

In [259]:
#test
np.sign(data).head()*3

     0    1    2    3
0  3.0 -3.0  3.0  3.0
1  3.0 -3.0 -3.0 -3.0
2  3.0  3.0  3.0 -3.0
3 -3.0 -3.0  3.0 -3.0
4  3.0 -3.0  3.0  3.0

In [266]:
#test
data[np.abs(data) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [286]:
#test df.notna(), df.
>>> df = pd.DataFrame({'age': [5, 6, np.NaN],
...                    'born': [pd.NaT, pd.Timestamp('1939-05-27'),
...                             pd.Timestamp('1940-04-25')],
...                    'name': ['Alfred', 'Batman', ''],
...                    'toy': [None, 'Batmobile', 'Joker']})
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [287]:
df.isna() # Detect not existing (missing) boolean

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [289]:
df.isnull() #Detect not existing (missing) boolean

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [288]:
df.notna() # Detect existing (non-missing) boolean

     age   born  name    toy
0   True  False  True  False
1   True   True  True   True
2  False   True  True   True

In [290]:
df.notnull() #Detect not existing (missing) boolean

     age   born  name    toy
0   True  False  True  False
1   True   True  True   True
2  False   True  True   True

In [261]:
data

            0         1         2         3
0    0.627322 -0.360740  0.867818  0.666125
1    0.325341 -0.073107 -0.725240 -2.529919
2    0.094908  0.553004  1.092401 -1.884728
3   -0.866206 -0.340591  0.795713 -0.577072
4    0.539015 -0.882567  0.272218  0.993740
..        ...       ...       ...       ...
995 -0.322308  1.968456 -1.985934  0.136973
996 -0.657510 -1.980302 -0.290328 -1.423109
997 -0.651059 -0.004053 -1.123242  0.788778
998  0.008570  0.582121  0.281352 -0.328476
999  0.039018 -0.407103 -0.550964  1.463251

[1000 rows x 4 columns]

In [254]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014788    -0.014391     0.009988    -0.025268
std       1.014696     1.020249     0.978660     1.011315
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.658601    -0.702403    -0.662707    -0.708711
50%       0.002804    -0.007532     0.007000    -0.035584
75%       0.646669     0.691364     0.680052     0.638422
max       3.000000     2.991888     2.877019     3.000000

### Permutation and Random Sampling
* iloc -based indexing or the equivalent take function:
* choices.sample(n=10, replace=True)

In [295]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4))) #(5,4) array 
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [296]:
sampler = np.random.permutation(5) #default row-wise -> index
sampler

array([2, 4, 3, 0, 1])

In [297]:
df.take(sampler) #index

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [300]:
df.iloc[1:3] #row-wise (index)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [302]:
#random subset without replacement -> output changes every time,when excuted.

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [306]:
#sample with replacement (to allow repeat choices), pass replace=True to sample :
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [312]:
# draws1 = choices.sample(n=10) #ValueError: Cannot take a larger sample than population when 'replace=False'
draws1 = choices.sample(n=4) # if more than size of choices,Series, replace = True.
draws1

0    5
1    7
2   -1
3    6
dtype: int64

In [309]:
draws = choices.sample(n=10, replace=True) #changes when excuted.
draws

0    5
4    4
3    6
4    4
0    5
0    5
4    4
0    5
1    7
1    7
dtype: int64

### Computing Indicator/Dummy Variables
* pd.get_dummies(df['key'])
----------------------
* dummies = pd.get_dummies(df['key'], prefix='key')
* df_with_dummy = df[['data1']].join(dummies)

In [314]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [315]:
df['key']

0    b
1    b
2    a
3    c
4    a
5    b
Name: key, dtype: object

In [316]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key']) # as for df['key']'s value 'a' 'b' 'c' -> matched index : 1 ,else :0

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

add a prefix to the columns in the indicator DataFrame, which can then be merged with the other data.

In [322]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [323]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [353]:
# pd.read_table? #read general delimiter file.

In [325]:
# !cat datasets/movielens/movies.dat
# 1::Toy Story (1995)::Animation|Children's|Comedy
# 2::Jumanji (1995)::Adventure|Children's|Fantasy
# 3::Grumpier Old Men (1995)::Comedy|Romance
# 4::Waiting to Exhale (1995)::Comedy|Drama
# 5::Father of the Bride Part II (1995)::Comedy
# 6::Heat (1995)::Action|Crime|Thriller

In [328]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None) # without names=... 
movies[:5]

/home/ys/anaconda3/envs/py37/lib/python3.7/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   0                                   1                             2
0  1                    Toy Story (1995)   Animation|Children's|Comedy
1  2                      Jumanji (1995)  Adventure|Children's|Fantasy
2  3             Grumpier Old Men (1995)                Comedy|Romance
3  4            Waiting to Exhale (1995)                  Comedy|Drama
4  5  Father of the Bride Part II (1995)                        Comedy

In [329]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames) #names= (for columns list)
movies[:10]

/home/ys/anaconda3/envs/py37/lib/python3.7/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [333]:
# list.extend? #Extend list by appending elements from the iterable.
x = [1, 2, 3]
x.append([4, 5])
print (x)
y = [1, 2, 3]
y.extend([4, 5])
print (y)

[1, 2, 3, [4, 5]]
[1, 2, 3, 4, 5]

In [334]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [335]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [341]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix.shape #(3883, 18)
# zero_matrix
# array([[0., 0., 0., ..., 0., 0., 0.],
#        [0., 0., 0., ..., 0., 0., 0.],
#        [0., 0., 0., ..., 0., 0., 0.],
#        ...,
#        [0., 0., 0., ..., 0., 0., 0.],
#        [0., 0., 0., ..., 0., 0., 0.],
#        [0., 0., 0., ..., 0., 0., 0.]])

(3883, 18)

In [344]:
dummies = pd.DataFrame(zero_matrix, columns=genres) ##(3883, 18)
print(dummies.shape)
dummies.head()

(3883, 18)

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

-- test
```
movies.genres

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                     Comedy|Romance
3                       Comedy|Drama
4                             Comedy
                    ...             
3878                          Comedy
3879                           Drama
3880                           Drama
3881                           Drama
3882                  Drama|Thriller
Name: genres, Length: 3883, dtype: object
```

In [357]:
gen = movies.genres[0] 
gen

"Animation|Children's|Comedy"

In [358]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [359]:
# test
dummies.columns #Index obj, not list

Index(['Animation', 'Children's', 'Comedy', 'Adventure', 'Fantasy', 'Romance',
       'Drama', 'Action', 'Crime', 'Thriller', 'Horror', 'Sci-Fi',
       'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir', 'Western'],
      dtype='object')

In [361]:
dummies.columns.get_indexer(gen.split('|')) #['Animation', "Children's", 'Comedy']'s index in dommies.columns

array([0, 1, 2])

In [362]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [365]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [364]:
#test
dummies.add_prefix('Genre_').head()

,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,Genre_Action,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [367]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [368]:
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genre_Animation                               1
Genre_Children's                              1
                               ...
Genre_War                                     0
Genre_Musical                                 0
Genre_Mystery                                 0
Genre_Film-Noir                               0
Genre_Western                                 0
Name: 0, Length: 21, dtype: object

In [371]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

In [372]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [373]:
val = 'a,b,  guido' #string
val.split(',')      #list

['a', 'b', '  guido']

In [374]:
# strip() to trim whitespace (including line breaks):
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [375]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [376]:
'::'.join(pieces)

'a::b::guido'

In [380]:
val # string

'a,b,  guido'

Decting substring - in val , val.index(',') , val.find(':')

In [377]:
'guido' in val

True

In [378]:
val.index(',')

1

In [379]:
val.find(':') #not found : return -1

-1

In [392]:
val2 = 'dd gd gdk'
val2.find('gd')

3

In [393]:
val2.rfind('gd')

6

In [397]:
print(val2.count('d'))
print(val2.count('gd'))

4
2

In [398]:
val2.endswith('dk')

True

In [389]:
val.rfind(',') #last

3

In [381]:
val = 'a,b,  guido' #string
try:
    val.index(':')
except ValueError as err:
    print(err)

substring not found

In [382]:
val.count(',')

2

In [385]:
val.replace(',', '::') #val not changed

'a::b::  guido'

In [386]:
val.replace(',', '')

'ab  guido'

### Python built-in string methods
|Argument|Description|
|:-------|:----------|
|count|Return the number of non-overlapping occurrences of substring in the string.|
|endswith|Returns True if string ends with suffix.|
|startswith||
|join||
|index|Return position of first character in substring if found in the string; raises ValueError if not found.|
|find|Return position of first character of first occurrence of substring in the string; like index , but returns –1 if not found.|
|rfind|Return position of first character of last occurrence of substring in the string; returns –1 if not found.|
|replace|
|strip,|Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip , respectively)|
|rstrip,||
|lstrip||
|split||
|lower||
|upper||
|casefold|Convert characters to lowercase, and convert any region-specific variable character combinations to a
common comparable form.|
|ljust,| respectively; pad opposite side of string with spaces (or some other fill character)|
|rjust||

### Regular Expressions
* findall returns all matches in a string, 
* search returns only the first match. 
* match only matches at the beginning of the string.
#### re module function: 
* pattern matching, 
* substitution,
* splitting.

In [400]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [401]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [402]:
regex.findall(text)

['    ', '\t ', '  \t']

1.   slide regex : http://python.slides.com/colt/regex#/
2.   regex cheat sheet: http://www.rexegg.com/regex-quickstart.html
3.   regex editor : https://pythex.org/
---------------------------------
* \d	digit 0-9
* \w	letter, digit, or underscore
* \s	whitespace character
* \D	not a digit
* \W	not a word character
* \S	not a whitespace character
* .	any character except line break
---------------------------
**a?**
* ?	Zero(None) or Once (optional) : name, names
* \*	Zero or more times (*)
* \+	One or more (+)
* {3}	Exactly x times.  {3} - 3 times
* {3,5}	Three to five times
* {4,}	Four or more times
---------------------
* ^	Start of string or line
* $	End of string or line
* \b	Word boundary
---------------------
```
* \d{3} \d{3}-?\d{4} <- 334 245-3657 : '-' is optional(-?)
* ^\d{3} \d{3}-?\d{4}  <- start with digit, ex)  asdd334 249-3657 is wrong representation.
* ^\d{3} \d{3}-?\d{4}$ <- $ end 
* "hello world I am typing" -> Just want word instead of white space before word and after word. -> \b  : word boundary -> \b\w+\b : hello, world, I, am, typing
  * Bob.*\bcat\b -> Bob ate the cat
* ``re.compile(r'\b\d{3} \d{3}-\d{4}\b)``  -> ``("my number is 423 564-5623")-> match: ("my number is 423 564-5623343") -> not match(5623 is 4digit boundary by \b)``
```

* ---------[ ] just return one char(digit)--------------
* [^arn]	Returns a match for any character EXCEPT a, r, and n
  * but ^ not inside of [ ] - start of string or start of line
  * ex)  ^abc.* -> abc (line start) <-> $: end of string, line
* [a-n]	Returns a match for any lower case character, alphabetically between a and n
* [arn]	Returns a match where one of the specified characters (a, r, or n) are present
* [a-zA-Z]	Returns a match for any character alphabetically between a and z, lower case OR upper case
* [0-5][0-9]	Returns a match for any two-digit numbers from 00 and 59
* ----------------------
* | logical or ex) Need to accept two forms of phone number: (124) 234 3265, 124 234 3265 ->
``(\(\d{3}\)|\d{3}) \d{3} \d{4}  ``
* ex) Mr. James Earn , Mrs. Maria Kim -> ``(Mr|Mrs\.) ([a-zA-Z]+) ([a-zA-Z]+) # 3 different components``
* ex) https://pythex.org, http://teraedu.com -> ``https?://([A-Za-z_-]+\.[A-Za-z_-]+)``
* Regex : ``Mr.|Mister Holmes``
  1. "Mr. Davis"
  2. "Mister Holmes"
  3. "Mr."
* Regex :  numbers 1 - 25 :  0-5, 10-15, 20-25 OR 0-9
  
```
 \b(0?[1-9]|1[0-9]|2[0-5])\b #good (no 00)
([01]?[0-9]|2[0-5]) # not good (00 exits)

// should omit those pesky one-offs you're seeing as mentioned in the comments.
^([01]?[0-9]|2[0-5])$
\b([01]?[0-9]|2[0-5])\b

// if you also want to exclude 0...
^([1-9]|1[0-9]|2[0-5])$
\b([1-9]|1[0-9]|2[0-5])\b
```

* Regex : | (or)
```
import re
def parse_name(input):
  name_regex = re.compile(r'^(Mr\.|Mrs\.|Ms\.|Mdme\.) (?P<second>[A-Za-z]+) (?P<third>[A-Za-z]+)$')
  matches = name_regex.search(input) 
  #matches = name_regex.findall(input) 
  print(matches.groups())
  #print(matches.group())
  #print(matches.group(0))
  #print(matches.group(second))
```

parse_name("Mdme. Shown Bobari")

  1. At the beginning , verify nothing else in the string -> ^ $
  2. ``?P<second>`` : group name 'second' -> label for the group ->  ``print(matches.group(second))`` same as ``print(matches.group(1)``)
  3. w3school useful regex example :  https://www.w3schools.com/python/python_regex.asp
  4. ``import re, re.finadll()`` -> all return, re.search() -> return first matched
```
import re
pattern = re.compile(r'\d{3} \d{3}-\d{4}')
res = pattern.search("call me at 310 456-6532")
print(res)
print(res.group())
##########################
res2 = pattern.search("call me at 310 456-6532 or 321-635-9654")
print(res2)
print(res2.group())
###########################
res3 = pattern.findall("call me at 310 456-6532 or 321-635-9654")
print(res3)
print(res3.group())
re.search(r'\d{3} \d{3}-\d{4}',"call me at 310 456-6532" ).group()
```
* ?P<label_name> 
``` 
  name_regex = re.compile(r'^(Mr\.|Mrs\.|Ms\.|Mdme\.) (?P<first>[A-Za-z]+) (?P<last>[A-Za-z]+)$')
	matches = name_regex.search(input) res = name_regex.search("Mr. Niel Brown")
  matches.group('first')
```

[regular expressions by example](https://www3.ntu.edu.sg/home/ehchua/programming/howto/Regexe.html)

In [ ]:
# Test under the Python Command-Line Interpreter
$ python3
......
>>> import re   # Need module 're' for regular expression

# Try find: re.findall(regexStr, inStr) -> matchedSubstringsList
# r'...' denotes raw strings which ignore escape code, i.e., r'\n' is '\'+'n'
>>> re.findall(r'[0-9]+', 'abc123xyz')
['123']   # Return a list of matched substrings
>>> re.findall(r'[0-9]+', 'abcxyz')
[]
>>> re.findall(r'[0-9]+', 'abc00123xyz456_0')
['00123', '456', '0']
>>> re.findall(r'\d+', 'abc00123xyz456_0')
['00123', '456', '0']

# Try substitute: re.sub(regexStr, replacementStr, inStr) -> outStr
>>> re.sub(r'[0-9]+', r'*', 'abc00123xyz456_0')
'abc*xyz*_*'

# Try substitute with count: re.subn(regexStr, replacementStr, inStr) -> (outStr, count)
>>> re.subn(r'[0-9]+', r'*', 'abc00123xyz456_0')
('abc*xyz*_*', 3)   # Return a tuple of output string and count

``r'...' denotes raw strings which ignore escape code, i.e., r'\n' is '\'+'n'``

In [405]:
import re
#1. matching
re.findall(r'[0-9]+', 'abc123xyz')

['123']

In [406]:
re.findall(r'[0-9]+', 'abcxyz')

[]

In [407]:
re.findall(r'[0-9]+', 'abc00123xyz456_0')

['00123', '456', '0']

In [408]:
re.findall(r'\d+', 'abc00123xyz456_0')

['00123', '456', '0']

In [409]:
#2. substitute
re.sub(r'[0-9]+', r'*', 'abc00123xyz456_0')

'abc*xyz*_*'

In [410]:
#2-1. substitute with count:
re.subn(r'[0-9]+', r'*', 'abc00123xyz456_0')

('abc*xyz*_*', 3)

a block of text and
a regular expression capable of identifying most email addresses:

In [411]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'  #1 component

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [412]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [413]:
# search returns a special match object for the first email address in the text.
m = regex.search(text)
m
# the match object can only tell us the start and end position of the
# pattern in the string:

In [414]:
text[m.start():m.end()]

'dave@google.com'

In [135]:
# regex.match returns None , as it only will match if the pattern occurs at the start of the string:
print(regex.match(text))

None

In [136]:
# sub will return a new string with occurrences of the pattern replaced by the
# a new string:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

find email addresses and simultaneously segment each
address into its three components:

In [415]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' # () @ () \. () -> 3 components
regex = re.compile(pattern, flags=re.IGNORECASE)

A match object produced by this modified regex returns a tuple of the pattern components with its groups method:

In [138]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [417]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

sub also has access to groups in each match using special symbols like \1

In [140]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))
# symbol \1 corresponds to the first matched group,
# Dave dave@google.com

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas
* Cleaning up a messy dataset for analysis
    * string munging and regularization
    * missing data

In [452]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [453]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [454]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [455]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [456]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [457]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [431]:
#test1
import re
def parse_name(input):
	name_regex = re.compile(r'^(Mr\.|Mrs\.|Ms\.|Mdme\.) (?P<first>[A-Za-z]+) (?P<last>[A-Za-z]+)$')
	matches2 = name_regex.search(input)
	print(matches2.group())
	print(matches2.group('first'))
	print(matches2.group('last'))

parse_name("Mrs. Tilda Swinton")

Mrs. Tilda Swinton
Tilda
Swinton

In [432]:
#test2
url_regex = re.compile(r'(https?)://(www\.[A-za-z-]{2,256}\.[a-z]{2,6})([-a-zA-Z0-9@:%_\+.~#?&//=]*)')
match = url_regex.search("https://www.my-website.com/bio?data=blah&dog=yes")
print(f"Protocol: {match.group(1)}")
print(f"Domain: {match.group(2)}")
print(f"Everything Else: {match.group(3)}")
print(match.groups())
print(match.group())

Protocol: https
Domain: www.my-website.com
Everything Else: /bio?data=blah&dog=yes
('https', 'www.my-website.com', '/bio?data=blah&dog=yes')
https://www.my-website.com/bio?data=blah&dog=yes

In [433]:
#test3import re
def parse_bytes(input):
    # byte_regex = re.compile(r'\b[01]{8}+\b') #multiple repeat at position 9-> error
    byte_regex = re.compile(r'\b[0-1]{8}\b')
    # byte_regex = re.compile(r'\b[01]{8}\b') #sane as above
    # byte_regex = re.compile(r'\b[0,1]{8}\b') #sane as above
    return byte_regex.findall(input) # return a list of all matches

print(parse_bytes("11010101 101 323"))
print(parse_bytes("my data is: 10101010 11100010"))
print(parse_bytes("asdsa"))

['11010101']
['10101010', '11100010']
[]

In [434]:
#test4
#Accept input format such as dd/mm/yyyy, 
# dd.mm.yyyy dd,mm,yyyy  -> order such as month date year 
# rerun dict, { "d": date, "m": month, "y": year}
############### [] set -> represnet just one char(digit)#######
############### [0-20] -> just 0 , 1 represented 
import re
def parse_date(input):
    date_regex = re.compile(r'^(\d\d)[,/.](\d\d)[,/.](\d{4})$') 
    match = date_regex.search(input)
    if match:
        return {"m":match.group(1), "d":match.group(2), "y":match.group(3)}
    return None

def parse_date1(input):
    #mm: one digit(0 - 9) then two digit(10, 11, 12) -> [0-9]|1[0-2]   
    date_regex = re.compile(r'\b(0[1-9]|1[0-2])[.,/](0[1-9]|1[0-9]|2[0-9]|3[01])[.,/](\d{4})\b')
    match = date_regex.search(input)
    if match:
        return {"m":match.group(1), "d":match.group(2), "y":match.group(3)}
    return None

print("-------- with ^ $ (start end)---------")
print(parse_date("01/22/1999"))
print(parse_date("12,04,2003"))
print(parse_date("12.04.2003"))
print(parse_date("12.04.200312"))
print(parse_date("25.04.2003"))  #not filter month 25!!
print("-------with \b \b (word bounding)------")
print(parse_date1("01/22/1999"))
print(parse_date1("12,04,2003"))
print(parse_date1("12.04.2003"))
print(parse_date1("12.04.200312"))
print(parse_date1("25.04.2003")) #filter month 25

-------- with ^ $ (start end)---------
{'m': '01', 'd': '22', 'y': '1999'}
{'m': '12', 'd': '04', 'y': '2003'}
{'m': '12', 'd': '04', 'y': '2003'}
None
{'m': '25', 'd': '04', 'y': '2003'}
-------with   (word bounding)------
{'m': '01', 'd': '22', 'y': '1999'}
{'m': '12', 'd': '04', 'y': '2003'}
{'m': '12', 'd': '04', 'y': '2003'}
None
None

vectorized element retrieval : **str.get**  ,  **str**

In [444]:
#test
s = pd.Series(["String",
               (1, 2, 3),
               ["a", "b", "c"],
               123,
               -456,
               {1: "Hello", "2": "World"}])
s

0                        String
1                     (1, 2, 3)
2                     [a, b, c]
3                           123
4                          -456
5    {1: 'Hello', '2': 'World'}
dtype: object

In [445]:
#test: vectorized element retrieval
s.str.get(1) #each row with column index 1(2nd)

0        t
1        2
2        b
3      NaN
4      NaN
5    Hello
dtype: object

In [447]:
#test
s.str[1]

0        t
1        2
2        b
3      NaN
4      NaN
5    Hello
dtype: object

In [451]:
## from previous matches
matches = data.str.match(pattern, flags=re.IGNORECASE)
print(type(matches))
print(matches.shape)
print("index:", matches.index)
matches

<class 'pandas.core.series.Series'>
(4,)
index: Index(['Dave', 'Steve', 'Rob', 'Wes'], dtype='object')

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [469]:
try:
   matches.str.get(1)
except AttributeError as err:
    print(err)
    
try:
    matches.str[0]
except AttributeError as err:
    print(err)

Can only use .str accessor with string values!
Can only use .str accessor with string values!

In [466]:
print(type(data))
print(data.index)
print(data.Dave)
data

<class 'pandas.core.series.Series'>
Index(['Dave', 'Steve', 'Rob', 'Wes'], dtype='object')
dave@google.com

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [463]:
list(data)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', nan]

In [459]:
# slice strings :
data.str[:5] #data.str -> Series's value

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

## Conclusion